W9D3/cats/app/views/cats/index.html.erb

SELECT "cats".* FROM "cats"
---
<ul>
  <% Cat.all.each do | cat | %>