W9D3/cats/app/views/cats/show.html.erb

    </tr>
    <% @cat.cat_rentals.order('start_date DESC').each do |rental| %>
---
SELECT "cat_rentals".* FROM "cat_rentals" WHERE "cat_rentals"."cat_id" = $1 ORDER BY start_date DESC  [["cat_id", 2]]


<% @cat.cat_rentals.order('start_date DESC').each do |rental| %>
---
SELECT "cat_rentals".* FROM "cat_rentals" WHERE "cat_rentals"."cat_id" = $1 ORDER BY start_date DESC  [["cat_id", 1]]