W9D3/cats/app/views/cat_rentals/new.html.erb

    <option disabled selected>Select your cat</option>
    <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"