W9D1/routproj/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "email@email.com"], ["updated_at", "2019-12-10 00:55:45.579524"], ["id", 3]]
---
    def update
        user = User.find(params[:id])
        if user.update_attributes(user_params)