W10D1/progress_tracker/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        @user.save!
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "session_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"