W9D2/art_share/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks"
---
    def index
        if params[:user_id]
            user = User.find(params[:user_id])
            render json: user.artworks
        else
            render json: Artwork.all