W9D2/art_share/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
    def favorites
        user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "name1"]]
SELECT "users".* FROM "users"
---
    def index
        query_val = params[:username]
        if query_val
            user = User.where(username: query_val)
            render json: user
        else
            render json: User.all