W9D3/cats/app/models/cat_rental.rb

    def approve!
        self.status = 'APPROVED'
        self.save
        overlapping_pending_requests.each do | req |
            req.status = 'DENIED'
            req.save
---
UPDATE "cat_rentals" SET "status" = $1 WHERE "cat_rentals"."id" = $2  [["status", "APPROVED"], ["id", 4]]
UPDATE "cat_rentals" SET "status" = $1 WHERE "cat_rentals"."id" = $2  [["status", "DENIED"], ["id", 8]]

    def deny!
        self.status = 'DENIED'
        self.save
---
UPDATE "cat_rentals" SET "status" = $1 WHERE "cat_rentals"."id" = $2  [["status", "DENIED"], ["id", 4]]