W9D5/music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "user1@user.com"], ["password_digest", "$2a$12$k0wnSjf7lZeRABgSMsWKX./jphpon9OAK3HbX.iYEJT2o1.WlJEDm"], ["session_token", "amdxB5rkODSQhpBO9TfSEA"]]
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @user = User.find(current_user.id)