W10D4/reddit_clone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "aIvDpvvzQCE1-VmhdvIzQg"], ["updated_at", "2019-12-19 22:42:01.543400"], ["id", 3]]
---
    def reset_token!
        self.session_token = User.generate_token
        self.save!