W9D3/cats/app/controllers/cat_rentals_controller.rb

INSERT INTO "cat_rentals" ("cat_id", "start_date", "end_date") VALUES ($1, $2, $3) RETURNING "id"  [["cat_id", 6], ["start_date", "2019-12-12"], ["end_date", "2019-12-14"]]
---
    def create
        @cat_rental = CatRental.new(cat_rental_params)
        if @cat_rental.save

SELECT  "cat_rentals".* FROM "cat_rentals" INNER JOIN "cats" ON "cats"."id" = "cat_rentals"."cat_id" ORDER BY "cat_rentals"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
    def current_rental_requests
        @cat_rental ||= CatRental.joins(:cat).last