W10D4/reddit_clone/app/controllers/sessions_controller.rb

    def destroy
        user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]