W10D4/reddit_clone/app/views/subs/index.html.erb

<ul>
    <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"