W13D4/todos/todos/app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "body", "done") VALUES ($1, $2, $3) RETURNING "id"  [["title", "eat"], ["body", "this"], ["done", true]]
---
    def create
        @todo = Todo.new(todo_params)
        if @todo.save